tutorials/suspensionFlows/oilWaxFoam/tjunction_orig/0/T.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 1;

boundaryField
{
  inlet_additive
    {
        type            fixedValue;
        value           uniform 1;
    }

    outlet
    {
        type             zeroGradient;
    }

    inlet_oil
    {
       type            fixedValue;
        value           uniform 1;
    }

    warm_walls
    {
        type            fixedValue;
        value           uniform 1;
    }

    cold_walls
    {
        type            fixedValue;
        value           uniform 0;
    }
    empty
    {
        type            empty;
    }
}

// ************************************************************************* //
