tutorials/suspensionFlows/oilWaxFoam/tjunction_orig/0/p.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
   inlet_additive
    {
        type            zeroGradient;
//         value           uniform 0;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    inlet_oil
    {
        type            fixedValue;
        value           uniform 1000;
    }

    warm_walls
    {
        type            zeroGradient;
    }

    cold_walls
    {
        type            zeroGradient;
    }
    empty
    {
        type            empty;
    }
}

// ************************************************************************* //
