tutorials/suspensionFlows/oilWaxFoam/tjunction_orig/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;
nu              nu   [0 2 -1 0 0 0 0]       1;
Dc              Dc   [0 2 -1 0 0 0 0]    1e-5;
Dpsi            Dpsi [0 2 -1 0 0 0 0]    1e-10;
DT              DT   [0 2 -1 0 0 0 0]    1e-6;
psim            psim [0 0 0 0 0 0 0]      1.2;
St              St   [0 0 1 0 0 0 0]    1e-12;
tau1            tau1 [0 0 1 0 0 0 0]     1e-3;
tau2            tau2 [0 0 1 0 0 0 0]     1e12;
crif            crif [0 -3 0 0 0 0 0]       1;
cT              crif [0 -3 0 -1 0 0 0]      1;
//gamma           gamma[0 2 -1 0 0 0 0] 2.76e-9;
dh              dh   [1 2 -2 0 0 0 0]       1;
ds              ds   [1 2 -2 -1 0 0 0]      1;
Trif            Trif [0 0 0 1 0 0 0]        1;
//R               R    [1 2 -2 -1 -1 0 0] 8.314;
psifact         psifact [0 3 0 0 0 0 0 ]    1;
// ************************************************************************* //
